src/Catalogs/КомандыАвтоматизации/КомандыАвтоматизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КомандыАвтоматизации</name>
  <attributes>
    <name>Поставляется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыОбязательные</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеПараметраВАгенте</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполненияПараметра</name>
      <type>
        <types>EnumRef.СпособыЗаполненияПараметровКоманды</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтносительнаяСсылкаНаРеквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыДополнительные</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеПараметраВАгенте</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗаполненияПараметра</name>
      <type>
        <types>EnumRef.СпособыЗаполненияПараметровКоманды</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтносительнаяСсылкаНаРеквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МетаданныеСвязанныхОбъектов</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтурыАдминистрирования</name>
    <comment>Используется для ограничения доступа к данным. Если не выбрано, доступно всем</comment>
    <attributes>
      <name>Контур</name>
      <type>
        <types>CatalogRef.КонтурыАдминистрирования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/КомандыАвтоматизации/Forms/ФормаСписка/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборПоДоступным();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоДоступным()
	Если Не РаботаСоСценариямиАвтоматизацииПраваДоступа.ПроверитьНаличиеПолногоДоступаКФункционалуАвтоматизации() Тогда
		
		Ограничения = РаботаСоСценариямиАвтоматизацииПовторноеИспользование.ПолучитьСписокОграниченийДляТекущегоПользователя();
		
		Если Ограничения.Количество() > 0 Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	КомандыАвтоматизации.Ссылка КАК Ссылка
			                      |ИЗ
			                      |	Справочник.КомандыАвтоматизации КАК КомандыАвтоматизации
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КомандыАвтоматизации.КонтурыАдминистрирования КАК КомандыАвтоматизацииКонтурыАвтоматизации
			                      |		ПО КомандыАвтоматизации.Ссылка = КомандыАвтоматизацииКонтурыАвтоматизации.Ссылка
			                      |ГДЕ
			                      |	КомандыАвтоматизацииКонтурыАвтоматизации.Ссылка ЕСТЬ NULL
			                      |
			                      |ОБЪЕДИНИТЬ ВСЕ
			                      |
			                      |ВЫБРАТЬ
			                      |	КомандыАвтоматизации.Ссылка
			                      |ИЗ
			                      |	Справочник.КомандыАвтоматизации КАК КомандыАвтоматизации
			                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КомандыАвтоматизации.КонтурыАдминистрирования КАК КомандыАвтоматизацииКонтурыАвтоматизации
			                      |		ПО КомандыАвтоматизации.Ссылка = КомандыАвтоматизацииКонтурыАвтоматизации.Ссылка
			                      |			И (КомандыАвтоматизацииКонтурыАвтоматизации.Контур В (&ДоступныеКонтуры))");
			Запрос.УстановитьПараметр("ДоступныеКонтуры", Ограничения);
			
			ОтборКоманд = Запрос.Выполнить().Выгрузить();
			
			РаботаСоСценариямиАвтоматизацииПраваДоступа.УстановитьОтборПоДоступнымЭлементамНаСписокФормы(Список, ОтборКоманд.ВыгрузитьКолонку("Ссылка"));
		КонецЕсли;	
	КонецЕсли;		
КонецПроцедуры	

&НаСервере
Процедура СписокПриИзмененииНаСервере()
	УстановитьОтборПоДоступным();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	СписокПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти
